{
  "exampleProblems": [
    { "text": "I'm drowning in deadlines and responsibilities, I don't know how much more I can take.", "label": "Stress"},
    { "text": "I feel like a failure, like I'm not good enough to handle everything that's being thrown at me.", "label": "Stress"},
    { "text": "I can't shake this feeling of dread and impending doom, it's all-consuming.", "label": "Stress"},
    { "text": "I'm so overwhelmed, I can't think straight and my head feels like it's going to explode.", "label": "Stress"},
    { "text": "I'm at my wit's end, I don't know how to cope with this level of stress.", "label": "Stress"},
    { "text": "I feel like I'm stuck in a never-ending cycle of sadness and hopelessness.", "label": "Depression"},
    { "text": "I can't find the energy or motivation to do anything, I just feel numb.", "label": "Depression"},
    { "text": "I don't see the point in living, I feel like nothing will ever change.", "label": "Depression"},
    { "text": "I feel like I'm in a dark hole and I can't find my way out.", "label": "Depression"},
    { "text": "I feel like I'm just going through the motions of life, it all seems pointless.", "label": "Depression"},
    { "text": "I'm so anxious, I can't stop thinking about all the worst-case scenarios that could happen.", "label": "Anxiety"},
    { "text": "I feel like I'm on edge all the time, like something bad is going to happen at any moment.", "label": "Anxiety"},
    { "text": "I'm so worried about failing, that it's making it hard for me to focus on anything else.", "label": "Anxiety"},
    { "text": "I'm constantly on guard, like I'm waiting for something bad to happen.", "label": "Anxiety"},
    { "text": "I can't shake this sense of impending doom, it's all-consuming.", "label": "Anxiety"},
    { "text": "I feel like I'm having a heart attack, I can't breathe and my chest is tight.", "label": "Panic Attack"},
    { "text": "I feel like I'm going to die, I can't control my breathing and my heart is racing.", "label": "Panic Attack"},
    { "text": "I'm so scared, I feel like I'm losing control of my body.", "label": "Panic Attack"},
    { "text": "I can't think straight, my thoughts are jumbled and I'm so scared.", "label": "Panic Attack"},
    { "text": "I'm having a panic attack, I need to get out of here.", "label": "Panic Attack"},
    {"text": "I'm struggling to keep up with the workload, it's overwhelming.", "label": "School"},
    {"text": "I'm so stressed about my grades, I can't focus on anything else.", "label": "School"},
    {"text": "I'm worried about failing, I don't know how to catch up.", "label": "School"},
    {"text": "I'm having a hard time staying motivated, it's affecting my grades.", "label": "School"},
    {"text": "I'm struggling to balance school and other commitments, it's too much.", "label": "School"},
    {"text": "I feel like my parents don't understand me and my problems.", "label": "Parents"},
    {"text": "I'm struggling to communicate with my parents, it's causing tension.", "label": "Parents"},
    {"text": "I feel like my parents are too controlling and don't trust me.", "label": "Parents"},
    {"text": "I'm constantly fighting with my parents and it's affecting my mental health.", "label": "Parents"},
    {"text": "I feel like my parents have unrealistic expectations of me.", "label": "Parents"},
    {"text": "I feel like I don't have any true friends, I'm alone.", "label": "Friends"},
    {"text": "I'm struggling to make friends, it's affecting my self-esteem.", "label": "Friends"},
    {"text": "I'm having a hard time trusting people, it's affecting my relationships.", "label": "Friends"},
    {"text": "I'm feeling left out and excluded by my friends.", "label": "Friends"},
    {"text": "I'm struggling to maintain friendships, they seem to be falling apart.", "label": "Friends"},
    {"text": "I'm having a hard time falling asleep, my mind won't stop racing.", "label": "Sleep"},
    {"text": "I'm struggling to stay asleep, I wake up multiple times during the night.", "label": "Sleep"},
    {"text": "I'm having nightmares that are affecting my sleep.", "label": "Sleep"},
    {"text": "I'm so tired, but I can't seem to get the restful sleep I need.", "label": "Sleep"},
    {"text": "I'm having trouble sleeping because of stress and anxiety.", "label": "Sleep"},
    {"text": "I can't stop thinking about hurting myself, it's all I can think about.", "label": "Self-harm"},
    {"text": "I'm using self-harm as a way to cope with my emotional pain.", "label": "Self-harm"},
    {"text": "I'm struggling to stop self-harming, I feel like I need it to survive.", "label": "Self-harm"},
    {"text": "I'm ashamed of my self-harm scars and try to hide them.", "label": "Self-harm"},
    {"text": "I'm feeling guilty and ashamed of my self-harm behavior and don't know how to stop.", "label": "Self-harm"},
    {"text": "I feel so sad, I can't shake this feeling of hopelessness", "label": "Sadness"},
    {"text": "I'm feeling down and unmotivated, it's affecting my daily life", "label": "Sadness"},
    {"text": "I'm struggling to find joy in things I used to love", "label": "Sadness"},
    {"text": "I feel like I'm in a constant state of sadness", "label": "Sadness"},
    {"text": "I feel like I'm stuck in a rut and can't get out of my sadness", "label": "Sadness"},
    {"text": "I'm feeling so angry, I can't control my temper", "label": "Anger"},
    {"text": "I'm struggling to manage my anger and it's affecting my relationships", "label": "Anger"},
    {"text": "I feel like I'm always on the verge of losing my cool", "label": "Anger"},
    {"text": "I'm feeling so resentful, I can't shake this feeling of bitterness", "label": "Anger"},
    {"text": "I'm struggling to control my anger, it's getting the best of me", "label": "Anger"}
  ],
  "exampleSeverity": [
    { "text": "I've been feeling a bit down lately, but I'm not sure why.", "label": "mild" },
    { "text": "I've been having trouble sleeping and I'm not sure why.", "label": "mild" },
    { "text": "I've been feeling a bit more anxious than usual, but it's not affecting my daily life.", "label": "mild" },
    { "text": "I've been having some trouble focusing on my tasks.", "label": "mild" },
    { "text": "I'm feeling a bit overwhelmed by everything going on in my life.", "label": "mild" },
    { "text": "I've been feeling really down for the past few weeks and it's starting to affect my work.", "label": "moderate" },
    { "text": "I've been having panic attacks and it's making it hard for me to leave my house.", "label": "moderate" },
    { "text": "I've been having trouble sleeping and it's affecting my energy during the day.", "label": "moderate" },
    { "text": "I've been feeling really anxious and it's affecting my daily life.", "label": "moderate" },
    { "text": "I've been feeling really sad and hopeless.", "label": "moderate" },
    { "text": "I've been feeling suicidal and I'm not sure how much longer I can handle this.", "label": "severe" },
    { "text": "I've been experiencing severe and constant panic attacks and it's making it impossible for me to function.", "label": "severe" },
    { "text": "I've been experiencing severe depression and I've stopped leaving my house and interacting with others.", "label": "severe" },
    { "text": "I've been struggling with self-harm and I'm not sure how to stop.", "label": "severe" },
    { "text": "I've been feeling so angry and it's affecting my relationship with others.", "label": "severe" }
  ],
  "sampleInputs": "This program will generate advice using an existing resource given some input, the problem, and the severity, and the emotion\n--\nInput: I've been feeling really overwhelmed with all the work I have to do. I feel like I'm constantly behind and I'm not sure how to catch up.\nProblem: Work\nSeverity: Mild\nAdvice: It's normal to feel overwhelmed with a lot of work. Try setting realistic goals, prioritizing tasks, and breaking them down into smaller, manageable chunks. Also, make sure to take breaks, engage in activities you enjoy, and reach out to a teacher or tutor for extra help if needed.\n--\nInput: I've been struggling with depression for a while now and it's really affecting my motivation to go to school and do my work. I feel like I'm in a constant state of sadness and it's hard to shake it off.\nProblem: Depression\nSeverity: Moderate\nAdvice: Depression is difficult to deal with, but there are ways to manage it. Reach out to a counselor or therapist for support, try different activities you enjoy, and set small goals. Remember to be patient with yourself, it may take time to see improvement. Additionally, you can reach out to support groups, hotlines, and self-help books that may be helpful.\n--\nInput: I've been feeling really suicidal lately and I'm not sure how much longer I can go on like this. I'm scared and I don't know who to turn to for help.\nProblem: Suicidal thoughts\nSeverity: Severe\nAdvice: If you are experiencing thoughts of suicide, it's important to reach out for help as soon as possible. Contact a crisis hotline, go to the nearest emergency room, or speak to a trusted family member or friend. Remember that you're not alone and there is help available. A therapist or counselor can provide you with the support and guidance you need. You can also reach out to support groups and self-help resources.\n--\n"
}